PICdew/PIC24F/Demo_board/main.c
static void vTask_test1 (void *pvParameters );
static void vTask_test2 (void *pvParameters );
static void vTask_test3 (void *pvParameters );
static void vTask_test4 (void *pvParameters );
static void vTask_test5 (void *pvParameters );
static void ADK_Task (void *pvParameters );
/****************************************************************************
  Function:
    int main(void)

  Summary:
    main function

  Description:
    main function

  Precondition:
    None

  Parameters:
    None

  Return Values:
    int - exit code for main function

  Remarks:
    None
  ***************************************************************************/
int main(void)
{

    //USBInitialize(0);
    //AndroidAppStart(&myDeviceInfo);

    InitAllLEDs();
    //mInitPOT();
    //DEBUG_Init(0);

    InitI2C();

    Lcd_1602_Init(0x4E, 16, 2, LCD_5x8DOTS);  // set the LCD address to 0x27 for a 16 chars and 2 line display
    Lcd_1602_backlight();

    gyro_id = Gyro_MPU6050_Init();
    // I2C_Test();
    //MoterTest();
    //Sonar_HCSR04_Test();

    /* 第一个任务创建在优先级1上。优先级是倒数第二个参数。數字越高越好 */
    xTaskCreate( vTask_test1, ( signed char * )"T1", mainCHECK_TAKS_STACK_SIZE, NULL, 2, NULL );
    //xTaskCreate( vTask_test2, ( signed char * )"T2", mainCHECK_TAKS_STACK_SIZE, NULL, 2, NULL );
    //xTaskCreate( vTask_test3, ( signed char * )"T3", mainCHECK_TAKS_STACK_SIZE, NULL, 2, NULL );
    xTaskCreate( vTask_test4, ( signed char * )"T4", mainCHECK_TAKS_STACK_SIZE, NULL, 2, NULL );
    xTaskCreate( vTask_Sonar_HCSR04, ( signed char * )"Sr", mainCHECK_TAKS_STACK_SIZE, NULL, 2, NULL );
    xTaskCreate( vTask_StepMoter_28BYJ48, ( signed char * )"MT", mainCHECK_TAKS_STACK_SIZE, NULL, 2, NULL );

    //xTaskCreate( ADK_Task, ( signed char * )"T9", mainCHECK_TAKS_STACK_SIZE, NULL, 2, NULL );
    /* Finally start the scheduler. */
    vTaskStartScheduler();
    return 0;
}

static void vTask_test1 (void *pvParameters )
{
    BYTE a;
    portTickType xLastWakeTime;

    // this is test  git
    a = 0;
    xLastWakeTime = xTaskGetTickCount();
    for( ;; )
    {
        vTaskDelayUntil( &xLastWakeTime, 1000);
        // vTaskDelay( 2000 );
        if (a != 0) {LED0_On();} else {LED0_Off();};
        a = 1-a;
    }
}

static void vTask_test2 (void *pvParameters )
{
    BYTE a;
   portTickType xLastWakeTime;

    a = 0;
    xLastWakeTime = xTaskGetTickCount();
    for( ;; )
    {
        vTaskDelayUntil( &xLastWakeTime, 500);
        //vTaskDelay( 500 );
        if (a != 0) {LED1_On();} else {LED1_Off();};
        a = 2-a;
    }
}
static void vTask_test3 (void *pvParameters )
{
    BYTE a;
    portTickType xLastWakeTime;

    a = 0;
    xLastWakeTime = xTaskGetTickCount();
    for( ;; )
    {
        vTaskDelayUntil( &xLastWakeTime, 1000);
        // vTaskDelay( 1000 );
        if (a != 0) {
            LED2_On();
        } else {
            LED2_Off();
        };
        a = 4-a;

     }
}

BYTE log_value;
BOOL logNeedsUpdate;
static void vTask_test4 (void *pvParameters )
{
    UINT8 a,b;
    INT16 acc_x, acc_y, acc_z, temp;
    INT16 gyro_x, gyro_y, gyro_z;
    portTickType xLastWakeTime;

    logNeedsUpdate = FALSE;
    a = b = 0;
    log_value = 0;
    xLastWakeTime = xTaskGetTickCount();
    for( ;; )
    {
        vTaskDelayUntil( &xLastWakeTime, 20);
        // vTaskDelay( 1000 );
        logNeedsUpdate = TRUE;
        if (gyro_id == Gyro_MPU6050_ID)
        {
            if (a) {
                temp = Gyro_MPU6050_GetData(ACCEL_XOUT_H);
                if (temp != acc_x) {
                    acc_x = temp;
                    //Lcd_1602_Display10BitData(acc_x,2,0);
                    if (temp > 0)
                        b = MOTOR_CCW;
                    else
                        b = MOTOR_CW;
                    StepMoter_28BYJ48_Direction(b);

                }
#if 0
                temp = Gyro_MPU6050_GetData(ACCEL_YOUT_H);
                if (temp != acc_y) {
                    acc_y = temp;
                    Lcd_1602_Display10BitData(acc_y,7,0);
                }
                temp = Gyro_MPU6050_GetData(ACCEL_ZOUT_H);
                if (temp != acc_z) {
                    acc_z = temp;
                    Lcd_1602_Display10BitData(acc_z,12,0);
                }
#endif
            } else {
                temp = Gyro_MPU6050_GetData(GYRO_XOUT_H);
                if (temp != gyro_x) {
                    gyro_x = temp;
                    //Lcd_1602_Display10BitData(gyro_x,2,1);
                }
#if 0
                temp = Gyro_MPU6050_GetData(GYRO_YOUT_H);
                if (temp != gyro_y) {
                    gyro_y = temp;
                    Lcd_1602_Display10BitData(gyro_y,7,1);
                }

                temp = Gyro_MPU6050_GetData(GYRO_ZOUT_H);
                if (temp != gyro_z) {
                    gyro_z = temp;
                    Lcd_1602_Display10BitData(gyro_z,12,1);
                }
#endif
            }
            a = 1-a;
        }
     }
}


static void ADK_Task (void *pvParameters )
{
    DWORD size = 0;
    BOOL responseNeeded;
    BYTE pushButtonValues = 0xFF;
    BYTE potPercentage = 0xFF;
    BOOL buttonsNeedUpdate = FALSE;
    BOOL potNeedsUpdate = FALSE;
    BOOL readyToRead = TRUE;
    BOOL writeInProgress = FALSE;
    BYTE tempValue = 0xFF;
    BYTE errorCode;
    ACCESSORY_APP_PACKET* command_packet = NULL;

    BOOL connected_to_app = FALSE;
    BOOL need_to_disconnect_from_app = FALSE;

    //USBInitialize(0);
    //AndroidAppStart(&myDeviceInfo);
    responseNeeded = FALSE;

    //mInitPOT();
    //DEBUG_Init(0);

    while(1)
    {
        //Keep the USB stack running
        USBTasks();
        vTaskDelay( 50 );
        //If the device isn't attached yet,
        if(device_attached == FALSE)
        {
            buttonsNeedUpdate = TRUE;
            potNeedsUpdate = TRUE;
            need_to_disconnect_from_app = FALSE;
            connected_to_app = FALSE;
            size = 0;

            //Reset the accessory state variables
            //InitAllLEDs();

            //Continue to the top of the while loop to start the check over again.
            continue;
        }

        //If the accessory is ready, then this is where we run all of the demo code

        if(readyToRead == TRUE)
        {
            errorCode = AndroidAppRead(device_handle, (BYTE*)&read_buffer, (DWORD)sizeof(read_buffer));
            //If the device is attached, then lets wait for a command from the application
            if( errorCode != USB_SUCCESS)
            {
                //Error
                DEBUG_PrintString("Error trying to start read");
            }
            else
            {
                readyToRead = FALSE;
            }
        }

        size = 0;

        if(AndroidAppIsReadComplete(device_handle, &errorCode, &size) == TRUE)
        {
            //We've received a command over the USB from the Android device.
            if(errorCode == USB_SUCCESS)
            {
                //Maybe process the data here.  Maybe process it somewhere else.
                command_packet = (ACCESSORY_APP_PACKET*)&read_buffer[0];
            }
            else
            {
                //Error
                DEBUG_PrintString("Error trying to complete read request");
            }

